fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ЗаплонированныеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перебор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	Адрес = ЗаписатьДанныеДляДиограммыГанта();
	ПараметрыФормы = Новый Структура("Адрес", Адрес);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, Элементы.ОтпускаСотрудников);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОформлениеСтроки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьКоличествоДнейОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьКоличествоДнейОтпуска();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьКоличествоДнейОтпуска()
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущиеДанные.ДнейОтпуска = (КонецДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала)) /86400;
	
	ОформлениеСтроки();
КонецПроцедуры

Процедура ОформлениеСтроки()
	
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДнейОтпуска");
	ТЗ.Свернуть("Сотрудник", "ДнейОтпуска");
	
	Для Каждого Колонка из ТЗ Цикл
		
		ПараметрыОтбора = Новый Структура("Сотрудник", Колонка.Сотрудник);
		НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого Строка из НайденныеСтроки Цикл	
			
			Если Колонка.ДнейОтпуска > 28 Тогда
				Строка.Перебор = Истина;	
		    Иначе
				Строка.Перебор = Ложь;	
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Оформление = УсловноеОформление.Элементы.Добавить();
	Оформление.Использование = Истина;
	
	ПолеОформляемое1 = Оформление.Поля.Элементы.Добавить();
	ПолеОформляемое1.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
	ПолеОформляемое2 = Оформление.Поля.Элементы.Добавить();
	ПолеОформляемое2.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаНачала");
	ПолеОформляемое3 = Оформление.Поля.Элементы.Добавить();
	ПолеОформляемое3.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаОкончания");
	
	Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Перебор");
	Отбор.ПравоеЗначение = Истина;
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование = Истина;
	Оформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьДанныеДляДиограммыГанта()
	
	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(, "Сотрудник, ДатаНачала, ДатаОкончания"));
	
	Возврат Адрес;

КонецФункции	
#КонецОбласти
